import CA from '../../assets/capitanAmerica.png'
import DS from '../../assets/doctorStrange.png'
import Hulk from '../../assets/hulk.png'
import IM from '../../assets/ironman.png'
import SM from '../../assets/spiderman.png'
import Thor from '../../assets/thor.png'

export const characters = [
    {
        id: '0',
        Image: CA,
        title: 'Капитан Америка',
        description: 'Болезненный юноша, непригодный к армейской службе, Стив Роджерс был усилен экспериментальной сывороткой до максимума физической формы, доступной человеку, чтобы помочь военным операциям США.',
    },
    {
        id: '1',
        Image: DS,
        title: 'Доктор Стрэндж',
        description: 'Талантливый доктор-нейрохирург Стивен Стрэндж, который после трагической автомобильной аварии должен отбросить эго и познать секреты скрытого мира мистики и альтернативных измерений.',
    },
    {
        id: '2',
        Image: Hulk,
        title: 'Халк',
        description:'Доктор Бэннер превращается в Халка, теряя контроль над собой. Кроме того, Халк появляется, когда самому Бэннеру угрожает опасность.',
    },
    {
        id: '3',
        Image: IM,
        title: 'Железный Человек',
        description: 'Тони Старк, гениальный изобретатель и богатейший промышленник с репутацией плейбоя, страдает от ранения, полученного им в плену, где его вынудили разработать для террористов оружие массового поражения. Вместо этого он создаёт высокотехнологичный костюм-броню, с помощью которого сбегает из плена.',
    },
    {
        id: '4',
        Image: SM,
        title: 'Человек-Паук', 
        description: 'После укуса необычного паука, Питер Паркер замечаеет, что у него появляются нечеловеческие способности и решает изменить мир к лучему.',
    },
    {
        id: '5',
        Image: Thor,
        title: 'Тор', 
        description: 'Тор - сын бога Одина (главы мира Асгард) и богини Йорд (одна из богинь Мидгарда (Земли)). Сразу после рождения он был отправлен отцом в мир Асгард, где воспитывался вместе со своим приемным братом Локи под присмотром приемной матери Фригги.',
    },
];

export const charactersLinks = [
    {
        title: 'Капитан Америка',
        link: 'https://marvel.fandom.com/ru/wiki/Стивен_Роджерс_(199999)',
    },
    {
        title: 'Доктор Стрэндж',
        link: 'https://marvel.fandom.com/ru/wiki/Стефан_Стрэндж_(199999)',
    },
    {
        title: 'Халк',
        link: 'https://marvel.fandom.com/ru/wiki/Брюс_Беннер_(199999)',
    },
    {
        title: 'Железный Человек',
        link: 'https://marvel.fandom.com/ru/wiki/Энтони_Старк_(199999)',
    },
    {
        title: 'Человек-Паук',
        link: 'https://marvel.fandom.com/ru/wiki/Питер_Паркер_(199999)',
    },
    {
        title: 'Тор',
        link: 'https://marvel.fandom.com/ru/wiki/Тор_Одинсон_(199999)',
    },
];
